Revit 2024 API
ElectricalSystem.LoadName Property
 The LoadName of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public string LoadName { get; set; }
Visual Basic
Public Property LoadName As String
	Get
	Set
Visual C++
public:
property String^ LoadName {
	String^ get ();
	void set (String^ value);
}
Remarks
 This property is used to retrieve the LoadName of the Electrical System.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace